# RbsFriction Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..RbsFriction Property
ParameterTypeId Class See Also
---
"Friction"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId RbsFriction { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property RbsFriction As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ RbsFriction {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace